domains/gpu-serving/blueprints/deepseek-v4-flash/results/r3/t6_mtp_qps1.0.log
INFO 05-19 18:08:12 [main.py:66] Unspecified platform detected, switching to CPU Platform instead.
INFO 05-19 18:08:12 [importing.py:45] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 05-19 18:08:12 [importing.py:69] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 05-19 18:08:12 [cpu.py:401] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f75f22c49a0>, trust_remote_code=False, seed=0, num_prompts=80, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='DeepSeek-V4-Flash', input_len=None, output_len=None, tokenizer='/mnt/nvme/models/DeepSeek-V4-Flash', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/results/r3_20260519_180746', result_filename='t6_mtp_qps1.0.json', ignore_eos=False, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-dc46dc54-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 05-19 18:08:13 [config.py:800] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 05-19 18:08:14 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 80/80 [01:26<00:00,  1.09s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     80        
Failed requests:                         0         
Request rate configured (RPS):           1.00      
Benchmark duration (s):                  86.96     
Total input tokens:                      163840    
Total generated tokens:                  40960     
Request throughput (req/s):              0.92      
Output token throughput (tok/s):         471.03    
Peak output token throughput (tok/s):    963.00    
Peak concurrent requests:                18.00     
Total token throughput (tok/s):          2355.15   
---------------Time to First Token----------------
Mean TTFT (ms):                          1062.07   
Median TTFT (ms):                        182.84    
P99 TTFT (ms):                           10809.15  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          14.19     
Median TPOT (ms):                        13.40     
P99 TPOT (ms):                           36.13     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.67     
Median ITL (ms):                         12.11     
P99 ITL (ms):                            147.77    
---------------Speculative Decoding---------------
Acceptance rate (%):                     24.15     
Acceptance length:                       1.24      
Drafts:                                  61906     
Draft tokens:                            61906     
Accepted tokens:                         14948     
Per-position acceptance (%):
  Position 0:                            24.15     
==================================================